## pandas

"pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool, built on top of the Python programming language." (__[https://pandas.pydata.org/](https://pandas.pydata.org/)__)

In [2]:
import pandas as pd

## pandas Data Structures

## Series

A series is a one-dimensional array-like object containing a sequence of values and an associated array of data labels (index). Examples taken from Python for *Data Analysis* by Wes McKinney.

In [3]:
obj = pd.Series([4, 7, -5, 3])

In [4]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

The values attribute returns the array representation of a series.

In [5]:
obj.values

array([ 4,  7, -5,  3])

The index attribute returns the index object of a series.

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

Creating a series with a label (index identifying each data point)

In [7]:
obj2 = pd.Series([4, 7, -5, 3], index=['b', 'd', 'a', 'c'])

Selecting a value by its index

In [8]:
obj[2]

-5

Selecting a object by its label

In [9]:
obj2['a']

-5

In [10]:
obj2[['b', 'a']]

b    4
a   -5
dtype: int64

Using NumPy functions or NumPy like operations

In [11]:
import numpy as np

In [12]:
# filtering with a boolean array scalar
obj2[obj2 > 0]

b    4
d    7
c    3
dtype: int64

In [13]:
# scalar multiplication
obj2 * 2

b     8
d    14
a   -10
c     6
dtype: int64

In [14]:
# applying math function
np.exp(obj2)

b      54.598150
d    1096.633158
a       0.006738
c      20.085537
dtype: float64

Using a Series in a dict like context

In [15]:
'b' in obj2

True

In [16]:
'e' in obj2

False

Creating a series by passing a Python dictionary. Series will have the dict's keys in sorted order.

In [17]:
sdata = { 'Ohio': 15000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [18]:
obj3 = pd.Series(sdata)

In [19]:
obj3

Ohio      15000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

Overwriting the dict keys

In [20]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [21]:
obj4 = pd.Series(sdata, index=states)

In [22]:
obj4

California        NaN
Ohio          15000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

Detecting missing data

In [23]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [24]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [25]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

A Series automatically aligns by index label in arithmetic operations (similar to a join operation)

In [26]:
obj3

Ohio      15000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [27]:
obj4

California        NaN
Ohio          15000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [28]:
obj3 + obj4

California         NaN
Ohio           30000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

The Series object itself and its index have a name attribute

In [29]:
obj4.name = 'population'

In [30]:
obj4.index.name = 'state'

In [31]:
obj4

state
California        NaN
Ohio          15000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

The index of a series can be altered by in-place assignment

In [32]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [33]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [34]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

## DataFrame

A DataFrame represents a rectangular table of data. It contains an ordered collection of columns and has a row and a column index.

In [35]:
# example of constructing a DataFrame from a list of equal-length lists of NumPy arrays
data = {
    'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
    'year':  [2000, 2001, 2002, 2001, 2002, 2003],
    'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
}
frame = pd.DataFrame(data)

In [36]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [37]:
# the head method selects only the first five rows
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

The order of the DataFrame's columns can be arranged by specifying a sequence of columns.

In [38]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [39]:
# passing a column that isn't contained in the dict
frame2 = pd.DataFrame(
    data, #
    columns=['year', 'state', 'pop', 'debt'], 
    index=['one', 'two', 'three', 'four', 'five', 'six']
)

In [40]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [41]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

Retrieving a column in a DataFrame as a Series

In [42]:
# by dict-like notation
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [43]:
# by attribute
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

Rows can be retrieved by position or name with the special *loc* attribute.

In [44]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

Columns can be modified by assignment.

In [45]:
# assignment by a scalar value
frame2['debt'] = 16.5

In [46]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [47]:
# assignment by an array of values
frame2['debt'] = np.arange(6.)

Assigning a Series a column:
- the Series' labels will be realigned exactly to the DataFrame index
- in any whole missing values will be inserted

In [48]:
val = pd.Series(
    [-1.2, -1.5, -1.7],
    index=['two', 'four', 'five']
)

In [49]:
frame2['debt'] = val

In [50]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

Example for deleting a column with the *del* keyword

In [51]:
frame2['eastern'] = frame2.state == "Ohio"

In [52]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [53]:
del frame2['eastern']

In [54]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN